src/cf/Catalogs/CRM_СостоянияИнтересов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_СостоянияИнтересов</Name>
			<Comment>Состояния интересов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВероятностьСделки</Name>
					<Comment>Вероятность сделки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДела</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыДелВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Состояние завершения интереса</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказаниеОжидаемойВыручки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/CRM_СостоянияИнтересов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

// Процедура выполняет заполнение предопределенных элементов справочника.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	// Элемент "ПервичныйИнтерес"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.ПервичныйИнтерес.ПолучитьОбъект();
	ЭлементСправочника.ВероятностьСделки			= 10;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	ЭлементСправочника.Завершено					= Ложь;
	ЭлементСправочника.РеквизитДопУпорядочивания	= 1;
	ЭлементСправочника.Записать();
	
	// Элемент "ВыявлениеПотребностей"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.ВыявлениеПотребностей.ПолучитьОбъект();
	ЭлементСправочника.ВероятностьСделки			= 40;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	ЭлементСправочника.Завершено					= Ложь;
	ЭлементСправочника.РеквизитДопУпорядочивания	= 2;
	ЭлементСправочника.Записать();
	
	// Элемент "ПодготовкаПредложения"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.ПодготовкаПредложения.ПолучитьОбъект();
	ЭлементСправочника.ВероятностьСделки			= 65;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	ЭлементСправочника.Завершено					= Ложь;
	ЭлементСправочника.РеквизитДопУпорядочивания	= 3;
	ЭлементСправочника.Записать();
	
	// Элемент "ПредложениеИЗакрытие"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.ПредложениеИЗакрытие.ПолучитьОбъект();
	ЭлементСправочника.ВероятностьСделки			= 95;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	ЭлементСправочника.Завершено					= Ложь;
	ЭлементСправочника.РеквизитДопУпорядочивания	= 4;
	ЭлементСправочника.Записать();
	
	// Элемент "ВыполнениеДоговора"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.ВыполнениеДоговора.ПолучитьОбъект();
	ЭлементСправочника.ВероятностьСделки			= 100;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	ЭлементСправочника.Завершено					= Ложь;
	ЭлементСправочника.РеквизитДопУпорядочивания	= 5;
	ЭлементСправочника.Записать();
	
	// Элемент "ИнтересЗакрыт"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.ИнтересЗакрыт.ПолучитьОбъект();
	ЭлементСправочника.ВероятностьСделки			= 100;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	ЭлементСправочника.Завершено					= Истина;
	ЭлементСправочника.РеквизитДопУпорядочивания	= 6;
	ЭлементСправочника.Записать();
	
	// Элемент "ИнтересПотерян"
	ЭлементСправочника = Справочники.CRM_СостоянияИнтересов.ИнтересПотерян.ПолучитьОбъект();
	ЭлементСправочника.ВероятностьСделки			= 100;
	ЭлементСправочника.ВидДела						= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	ЭлементСправочника.Завершено					= Истина;
	ЭлементСправочника.РеквизитДопУпорядочивания	= 7;
	ЭлементСправочника.Записать();
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.ВероятностьСделки) Тогда
		Представление = Данные.Наименование + " (" + Данные.ВероятностьСделки + "%)";
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ВероятностьСделки");

КонецПроцедуры

#КонецОбласти

#КонецЕсли
